<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\MenuItem;

class MenuSeeder extends Seeder
{
    public function run()
    {
        $WEEK = [
            1 => [ // Понедельник
                'breakfast' => [
                    ['Каша овсяная', 250, 200],
                    ['Яйцо вареное', 100, 150],
                ],
                'lunch' => [
                    ['Салат Оливье', 120, 250],
                    ['Борщ', 300, 300],
                    ['Котлета', 130, 400],
                    ['Пюре', 200, 250],
                ]
            ],
            2 => [ // Вторник
                'breakfast' => [['Оладьи со сметаной', 200, 350]],
                'lunch' => [['Суп овощной', 300, 300], ['Курица запечённая', 150, 500]],
            ],
            3 => [ // Среда
                'breakfast' => [['Бутерброд с сыром', 150, 180]],
                'lunch' => [['Плов', 300, 400], ['Салат из капусты', 150, 150]],
            ],
            4 => [ // Четверг
                'breakfast' => [['Сырники', 200, 350]],
                'lunch' => [['Рассольник', 300, 300], ['Тефтели', 180, 400]],
            ],
            5 => [ // Пятница
                'breakfast' => [['Булочка с маком', 100, 150]],
                'lunch' => [['Щи', 300, 300], ['Котлета по-киевски', 200, 500]],
            ],
            6 => [ // Суббота
                'breakfast' => [['Творожная запеканка', 200, 300]],
                'lunch' => [['Уха', 300, 400], ['Макароны с сыром', 250, 300]],
            ],
            7 => [ // Воскресенье
                'breakfast' => [['Блины с мёдом', 200, 300]],
                'lunch' => [['Грибной суп', 300, 300], ['Жаркое', 200, 450]],
            ]
        ];

        foreach ($WEEK as $day => $types) {
            foreach ($types as $type => $items) {
                foreach ($items as [$name, $weight, $price]) {
                    MenuItem::create([
                        'name' => $name,
                        'type' => $type,
                        'day' => $day,
                        'weight' => $weight,
                        'price' => $price
                    ]);
                }
            }
        }
    }
}
